Repository: OpenChain-Project/Reference-Material
Catalog: Guides/Official/OpenChain-Introductions/Onboarding-Handout/ja/Translation-Tools/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: OpenChain also has a wide community of volunteers helping to make open source compliance easier
ja: また、OpenChainには、オープンソース コンプライアンスの容易な実行を支援する幅広いボランティアのコミュニティが参加しています。

source: A conformant organization can advertise this fact on their website and promotional material, helping to ensure that potential suppliers and customers understand and can trust their approach to open source compliance.
ja: 適合組織は、Webサイトや販促資料でその事実をアピールできるため、商談の見込まれるサプライヤーや顧客も、オープンソース コンプライアンスに向けたその組織の取り組みを確実に理解し、信頼できるようになります。

source: A new conformity assessment standard that specifies a minimum standard for providing
ja: 適合性評価標準は、最小限必須なものを提示

source: Certify conformance with the OpenChain specification at https://www.openchainproject.org/conformance
ja: OpenChain仕様書適合性を検証するhttps://www.openchainproject.org/conformance

source: Common Process for Open Source Software Governance
ja: オープンソース ソフトウェア ガバナンスのための共通プロセス

source: Compliance has less impact on the software development process
ja: コンプライアンスがソフトウェア開発プロセスに大きな影響を与えない

source: Compliance with open source license obligations
ja: オープンソース ライセンスの義務を遵守

source: Contents
ja: もくじ

source: Core of the OpenChain Project
ja: OpenChainプロジェクトの根幹

source: Corporate Sponsorship and Board opportunities
ja: 企業スポンサーとなる、また、運営委員会に参加する

source: Curriculum
ja: カリキュラム

source: Desired State = Broad Respect for Developer Rights + Low Transaction Costs
ja: 望むべき状況 = 開発者の権利を幅広く尊重 + 少ない処理費用

source: Definitions
ja: 定義

source: Developed by a broad base of corporate and community participants
ja: 幅広い企業・コミュニティの参加者が作成

source: Documentation of policies
ja: ポリシーが文書化されている

source: Downstream recipients understand upstream compliance processes, can reuse compliance work
ja: 下流は、上流のコンプライアンス プロセスを理解し、それを再利用することが可能

source: Duplicated Compliance Efforts in Supply Chains
ja: 重複したコンプライアンスの取り組み

source: Each company in a supply chain needs to respect developer rights and license choices
ja: サプライチェーン上の各企業は開発者の権利とそのライセンスの選択を尊重する必要あり

source: Each company is re-creating essentially identical processes for open source compliance
ja: 各企業がオープンソース コンプライアンスに向けて、本質的に同一のプロセスを繰り返している

source: Each company needs to identify, track and comply with FOSS components used in software distributions
ja: 各企業のソフトウェアが使用するすべてのFOSSコンポーネントを特定し、それらが採用するライセンスの条件を遵守する必要がある

source: Educated personnel
ja: コンプライアンスを理解する要員の育成

source: First Steps
ja: 最初の一歩

source: For opportunities, see https://www.openchainproject.org/community
ja: OpenChainコミュニティについては、次のサイトを参照https://www.openchainproject.org/community

source: Frequently Asked Questions
ja: よくある質問

source: Friction Points Resolved
ja: OpenChainが提供する課題解決方法

source: G1: Know Your FOSS Responsibilities
ja: G1: FOSSに関連するいろいろな責任を理解する

source: G2: Assign Responsibility for Achieving Compliance
ja: G2: コンプライアンス履行の責任を割り当てる

source: G3: Review and Approve FOSS Content
ja: G3: FOSS内容物をレビューし、承認する

source: G4: Deliver FOSS Content Documentation and Artifacts
ja: G4: FOSS内容物に関するドキュメントとコンプライアンス証跡を外部に提供する

source: G5: Understand FOSS Community Engagement
ja: G5: FOSSコミュニティへの参加について理解する

source: G6: Certify Adherence to OpenChain Requirements
ja: G6: OpenChain諸要件の履行状況を検証する

source: Get Involved
ja: OpenChainに参加

source: Governance by a decision-making body with authority and expertise
ja: 権限と専門性を備えた社内の意志決定機関によるガバナンスが実行されている

source: Identifies a minimum level of processes that organizations of any size can use address open source compliance issues effectively
ja: どのような規模の組織でも利用可能な最小限のプロセスを規定しており、効果的にオープンソース コンプライアンスの課題に対処できる

source: Implement and document processes to meet the spec requirements.
ja: 仕様書の要件に合致したプロセスを実装し、文書化する。

source: Introduction
ja: はじめに

source: Join the Specification, Conformance process and Curriculum work teams
ja: 「仕様書」、「適合プロセス」、あるいは、「カリキュラム」の作業チームに参加

source: Licensed as CC-0, so remixing or sharing it freely for any purpose is possible
ja: CC-0 ライセンスで提供しており、目的に合わせて修正したり、共有したりすることが可能

source: May 2017
ja: 2017年5月

source: Monitoring of internal conformance
ja: 社内の適合性評価の過程が監視可能

source: More specifically, it provides a generic, refined and clear example of an open source compliance training program that can either be used directly or incorporated into existing training programs.
ja: すなわち、本カリキュラム スライドは、汎用的で、洗練された、また、明快なオープンソース コンプライアンス トレーニング プログラムの例を提供しており、それを教材として利用することもできれば、既存のトレーニング プログラムの中に組み込むこともできます。

source: More trustworthy results throughout the supply chain
ja: サプライチェーン全体のコンプライアンス遂行

source: On-Boarding
ja: オリエンテーション

source: Onboarding
ja: オリエンテーション

source: OpenChain Curriculum
ja: OpenChainカリキュラム

source: OpenChain Conformance can be done manually or via a free Online Self-Certification questionnaire provided by the OpenChain Project
ja: OpenChain 適合性の検証は、手作業、あるいは、OpenChainプロジェクトが無償で提供するオンライン自己診断質問集による

source: OpenChain Conformance
ja: OpenChain適合

source: OpenChain Conformance Specification
ja: OpenChain 適合仕様書

source: OpenChain Conformance can be done manually or via a free Online Self-Certification questionnaire provided by the OpenChain Project.
ja: OpenChainへの適合は、手作業によって、あるいは、OpenChainプロジェクトが無料で提供するオンラインの自己診断質問集によって行うことができます。

source: OpenChain Specification
ja: OpenChain仕様書

source: OpenChain has nine Platinum Members that support its development and adoption: Adobe, ARM, Cisco, GitHub, Harman, HPE, Qualcomm, Siemens and Wind River.
ja: OpenChainでは、以下の9社のプラチナ メンバーがその開発と採用を支援しています。Adobe、ARM、Cisco、GitHub、Harman、HPE、Qualcomm、Siemens、Wind River。

source: OpenChain provides a baseline process with freedom to optimize and customize
ja: OpenChainは、企業に合わせた最適化とカスタマイズが可能な基本プロセスを提示

source: Organizations can advertise their conformance on their website and promotional material
ja: 組織は、適合性をWebサイトや販促資材で宣伝できる

source: Organizations certify that they meet the requirements of a certain version of the OpenChain Specification
ja: 組織は、特定バージョンのOpenChain仕様書の要件を満たしていることを検証

source: Participate in bi-monthly work team calls
ja: 毎月2回開催される作業チームの電話会議に参加する

source: Provides a generic, refined and clear example of an open source compliance training program that can either be used directly or incorporated into existing training programs
ja: オープンソース コンプライアンスのトレーニング プログラムとして一般的で、洗練された、また、明快な事例を提供。それを直接教材として利用、または、既存のトレーニング プログラムの中に組み込んで活用

source: Receiving company has no visibility into compliance decisions or processes from upstream vendors
ja: 受領した企業からは、上流のコンプライアンス関連の決定事項やプロセスが見えない

source: Reliable internal processes include
ja: 信頼できる社内プロセスとは

source: Reliable internal processes
ja: 信頼できる社内プロセスの構築

source: Requirements
ja: 諸要件

source: Review the OpenChain specification at https://www.openchainproject.org/spec
ja: OpenChain仕様書を読む（日本語訳あり）https://www.openchainproject.org/spec

source: Supporters
ja: 支援者

source: The OpenChain Curriculum helps organizations meet certain aspects of the OpenChain Specification.
ja: OpenChainカリキュラムのスライドは、組織がOpenChain仕様書の諸要件を満たすことを手助けします。

source: The OpenChain Project identifies key recommended processes for effective open source management.
ja: OpenChainプロジェクトは、効率的なオープンソースマネージメントの鍵となる推奨プロセスを提示します。

source: The OpenChain Project offers a Specification and supporting material to help organizations of all sizes maximize their benefit from engagement with open source technology.
ja: OpenChainプロジェクトは、あらゆる規模の組織がオープンソース テクノロジーへの参画から最大の恩恵を得られるように、仕様書とサポート資料を提供しています。

source: The OpenChain Specification defines a core set of requirements every quality compliance program must satisfy.
ja: OpenChain仕様書は、あらゆる高い品質のコンプライアンス プログラムが満たさなければならない一連の基本的な要件を定義します。

source: The OpenChain Curriculum is available with very few restrictions to ensure organizations can use it in as many ways as possible.
ja: また、できるだけ多様な用途に向けてさまざまな組織が使用できるように、非常に少ない制約で利用できるようにしています。

source: The OpenChain Curriculum provides the educational foundation for open source processes and solutions, whilst meeting a key requirement of the OpenChain Specification. OpenChain Conformance allows organizations to display their adherence to these requirements.
ja: OpenChainカリキュラムは、OpenChain仕様書の主要な要件に沿って、さまざまなオープンソースのプロセスやソリューションに対応した教育基盤を提供しています。 同仕様に適合することにより、 組織はこれらの要件を履行していることを外部に示すことができます。

source: The Online Self-Certification service is available here in the English language: https://www.openchainproject.org/conformance
ja: オンライン自己診断サービスは、現在のところ英語のみですが、以下のサイトで利用できます。 https://www.openchainproject.org/conformance

source: The OpenChain Curriculum helps organizations meet certain aspects of the OpenChain Specification
ja: OpenChainカリキュラムは、組織がOpenChain仕様書を適用することを支援

source: The OpenChain Initiative began in 2013 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.
ja: OpenChainイニシアチブは、2013年、 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.

source: The OpenChain Project
ja: OpenChainプロジェクト

source: The OpenChain Project Onboarding 1.0 © 2016-2017 The Linux Foundation
ja: OpenChainオリエンテーション 第1.0版 © 2016-2017 The Linux Foundation

source: The OpenChain-Enabled Supply Chain
ja: OpenChainが実現するサプライチェーン

source: The Software Supply Chain Today
ja: 今日のソフトウェア サプライチェーン

source: The core of the OpenChain Project is the Specification.
ja: OpenChainプロジェクトの中核は仕様書です。

source: The main goal of organizations using the OpenChain Specification is to become conformant.
ja: OpenChain仕様書を使用する組織の主要な目標は、その適合組織となることです。

source: The mere meeting of a subset of these requirements would not be considered sufficient to warrant a program be OpenChain certified.
ja: 単にサブセットに適合したのでは、そのコンプライアンス プログラムはOpenChain準拠とはいえません。

source: The most important point is that OpenChain builds trust by providing a clear way to show adoption of industry-standard processes.
ja: 最も重要なポイントは、業界標準プロセスを採用していることを示す明快な手法を提示することで、OpenChainが信頼を築いていることです。

source: The project builds trust in open source by making open source license compliance simpler and more consistent.
ja: 同プロジェクトは、オープンソースのライセンス コンプライアンスをシンプルで、一貫性のあるものにすることで、オープンソースに対する信頼を築きます。

source: The result is that open source license compliance becomes more predictable, understandable and efficient for participants of the software supply chain.
ja: その結果、ソフトウェア サプライチェーンの参加者にとって、オープンソース ライセンス コンプライアンスがより予測可能で、理解しやすく、効率的なものになります。

source: The simple Online Self-Certification makes engagement as simple as possible. The Curriculum offers numerous training and best practice opportunities both inside and outside of activities directly related to the OpenChain Project.
ja: オンライン自己診断は、オープンソース テクノロジーへの参画を可能な限りシンプルにします。カリキュラムは、OpenChainプロジェクトに直結した活動の内外で、さまざまなトレーニングやベストプラクティスの機会を提供しています。

source: This document is made available under the Creative Commons CC0 1.0 Universal license.
ja: 本資料は、Creative Commons CC0 1.0 Universal ライセンスに基づいて提供しています。

source: This identifies identifies a series of processes that help ensure organizations of any size can address open source compliance issues effectively.
ja: この仕様書が提示する一連のプロセスは、あらゆる規模の組織が確実にオープンソース コンプライアンスの課題を効率よく処理できるよう手助けします。

source: This means that their organization meets the requirements of a certain version of the OpenChain Specification.
ja: それは当該組織が特定のバージョンのOpenChain仕様書の要件を満たしていることを意味します。

source: To accomplish this it is licensed as CC-0, effectively public domain, so remixing or sharing it freely for any purpose is possible.
ja: それを実現するために、本カリキュラム スライドは、事実上パブリック ドメインともみなすことのできるCC-0 ライセンスで提供されており、あらゆる目的に合わせて自由に作り直したり、共有したりできるようになっています。

source: Upstream compliance work is preserved, available, and reusable for others
ja: サプライチェーンの上流のコンプライアンス作業の結果を他社が再利用できるように保存・提供

source: Use the curriculum slides as an easy starting point for training - https://www.openchainproject.org/curriculum
ja: トレーニングの出発点として、カリキュラムの教材スライドを利用するhttps://www.openchainproject.org/curriculum

source: We recommend that organizations of all sizes use the Online Self-Certification. It is the quickest, easiest and most effective way to check and confirm adherence to the OpenChain Specification.
ja: すべての規模の組織にオンライン自己診断の利用をお勧めします。この自己診断は、OpenChain仕様書への適合性をもっとも迅速、容易、かつ効果率的にチェックおよび確認できる方法です。

source: When code moves downstream, receiving company has to perform the same work
ja: そのソフトウェアのコードがサプライチェーンの下流に配布されると、それを受領した企業は同じ作業を実施する必要がある

source: You can learn more about each aspect of the OpenChain Project here: https://www.openchainproject.org/faq
ja: OpenChainプロジェクトの各側面の詳細については、以下のWebサイトをご覧ください。 https://www.openchainproject.org/faq

source: You can learn more about the OpenChain Curriculum here: https://www.openchainproject.org/curriculum
ja: OpenChainカリキュラムの詳細については、以下のサイトで確認できます。https://www.openchainproject.org/curriculum

source: You can learn more about the OpenChain Specification here: https://www.openchainproject.org/spec
ja: OpenChain仕様書は、次のサイトでご覧になれます（日本語版もあります）。https://www.openchainproject.org/spec
